# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [3]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [27]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [14]:
df.to_csv('example.csv', index=False)

AttributeError: 'NoneType' object has no attribute 'to_csv'

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [18]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [4]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

NameError: name 'df' is not defined

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [7]:
df = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population')

In [8]:
df[0]

,Unnamed: 0,Location,Population,% of world,Date,Source (official or from the United Nations),Unnamed: 6
0,â€“,World,8120390000,100%,25 Jul 2024,UN projection[3],NaN
1,1/2 [b],China,1409670000,17.4%,31 Dec 2023,Official estimate[5],[c]
2,1/2 [b],India,1404910000,17.3%,1 Jul 2024,Official projection[6],[d]
3,3,United States,335893238,4.1%,1 Jan 2024,Official estimate[7],[e]
4,4,Indonesia,281603800,3.5%,1 Jul 2024,National annual projection[8],NaN
...,...,...,...,...,...,...,...
236,â€“,Niue (New Zealand),1681,0%,11 Nov 2022,2022 Census [234],NaN
237,â€“,Tokelau (New Zealand),1647,0%,1 Jan 2019,2019 Census [235],NaN
238,195,Vatican City,764,0%,26 Jun 2023,Official figure[236],[af]
239,â€“,Cocos (Keeling) Islands (Australia),593,0%,30 Jun 2020,2021 Census[237],NaN
240,â€“,Pitcairn Islands (UK),40,0%,1 Jul 2021,Official estimate[238],NaN

In [ ]:
type(df)

In [9]:
type(df)

list

_____
_____
# SQL (Optional)

* Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Pythonâ€™s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [23]:
from sqlalchemy import create_engine

In [24]:
engine = create_engine('sqlite:///:memory:')

In [28]:
df.to_sql('data', engine)

4

In [29]:
sql_df = pd.read_sql('data',con=engine)

In [30]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [31]:
from sqlalchemy import create_engine
import pandas as pd

# Create an engine for SQLite
engine = create_engine('sqlite:///example.db')

# Reading from a database table into a DataFrame
df = pd.read_sql_table('my_table', con=engine)

# Executing a query and reading the result into a DataFrame
df = pd.read_sql_query('SELECT * FROM my_table WHERE age > 25', con=engine)

# Writing a DataFrame to a database table
df.to_sql('new_table', con=engine, if_exists='replace', index=False)

ValueError: Table my_table not found